# Kaggle - TMDB

### Extract tables

**Here I will extract data from some of the fields in the raw data (e.g. average revenue by actor) and store it in `.csv` files**

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import ast

In [2]:
MILLION = 1000000

In [3]:
train = pd.read_csv('train.csv')

In [4]:
train.columns

Index(['id', 'belongs_to_collection', 'budget', 'genres', 'homepage',
       'imdb_id', 'original_language', 'original_title', 'overview',
       'popularity', 'poster_path', 'production_companies',
       'production_countries', 'release_date', 'runtime', 'spoken_languages',
       'status', 'tagline', 'title', 'Keywords', 'cast', 'crew', 'revenue'],
      dtype='object')

### belong_to_collection

In [5]:
train[train['belongs_to_collection'].notna()]['belongs_to_collection'].map(lambda x: len(ast.literal_eval(x))).unique()

array([1])

All lists have 1 element

In [6]:
dicts = train[train['belongs_to_collection'].notna()]['belongs_to_collection'].map(
    lambda x: ast.literal_eval(x)[0]).values

In [7]:
dicts[0]

{'id': 313576,
 'name': 'Hot Tub Time Machine Collection',
 'poster_path': '/iEhb00TGPucF0b4joM1ieyY026U.jpg',
 'backdrop_path': '/noeTVcgpBiD48fDjFVic1Vz7ope.jpg'}

In [8]:
# get all collections
collections = [d['id'] for d in dicts]

In [9]:
uniq,counts = np.unique(np.array(collections),return_counts=True)

In [10]:
counts

array([ 2,  3,  2,  3,  2,  3,  2,  3,  1,  1,  2,  2,  1,  2,  1, 16,  2,
        1,  2,  6,  1,  2,  1,  4,  2,  3,  2,  1,  3,  2,  1,  2,  1,  1,
        2,  2,  1,  1,  2,  3,  1,  3,  4,  1,  2,  4,  4,  2,  1,  4,  2,
        2,  1,  2,  1,  1,  5,  1,  4,  2,  1,  3,  7,  1,  1,  2,  1,  1,
        4,  2,  1,  1,  1,  1,  2,  1,  1,  1,  2,  1,  2,  1,  1,  1,  4,
        1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  2,  1,  1,  2,  2,  5,  1,
        4,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  3,  1,  1,  1,  1,  1,
        2,  2,  2,  1,  2,  1,  2,  2,  1,  1,  2,  1,  3,  1,  1,  1,  2,
        3,  1,  1,  2,  1,  1,  2,  1,  1,  1,  1,  1,  1,  3,  1,  2,  1,
        1,  1,  1,  1,  2,  1,  3,  3,  1,  1,  1,  1,  1,  1,  1,  1,  2,
        1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  2,  1,  1,  1,
        1,  1,  1,  1,  2,  1,  2,  2,  1,  2,  1,  1,  1,  1,  1,  1,  1,
        1,  1,  2,  1,  2,  1,  1,  1,  1,  1,  1,  2,  1,  1,  1,  1,  1,
        1,  1,  2,  2,  1,  1,  1,  1,  2,  2,  2,  3,  1,  1,  1,  1,  2,
        2,  1,  1,  1,  1,  1,  1,  1,  2,  1,  1,  1,  2,  1,  1,  1,  1,
        1,  1,  1,  1,  1,  1,  3,  1,  2,  1,  1,  1,  1,  1,  1,  1,  1,
        1,  1,  1,  2,  1,  1,  1,  1,  1,  1,  3,  1,  1,  1,  1,  1,  1,
        2,  2,  2,  1,  1,  1,  2,  1,  1,  1,  2,  1,  1,  1,  1,  2,  1,
        1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  2,  2,  1,  1,  1,  2,  1,
        1,  1,  1,  1,  1,  2,  1,  1,  1,  1,  1,  1,  2,  1,  1,  1,  1,
        1,  1,  1,  2,  1,  2,  1,  1,  1,  1,  1,  1,  1,  1,  1,  2,  1,
        1,  1,  2,  2,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,
        1,  1,  1,  1,  1,  2,  1,  2,  1,  2,  1,  1,  1,  1,  1,  1,  1,
        1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,
        1,  3,  1,  1,  1,  1,  1,  1,  1,  1,  1,  2,  1,  1])

In [11]:
counts[9], uniq[9]

(1, 328)

In [12]:
[d for d in dicts if d['id']==328]

[{'id': 328,
  'name': 'Jurassic Park Collection',
  'poster_path': '/qIm2nHXLpBBdMxi8dvfrnDkBUDh.jpg',
  'backdrop_path': '/pJjIH9QN0OkHFV9eue6XfRVnPkr.jpg'}]

Some collections seem to only have 1 item in them. Perhaps the other items are in the test set?

In [13]:
test = pd.read_csv('test.csv')

In [14]:
test[test['belongs_to_collection'].fillna('[{"id":-1}]').map(lambda x: (ast.literal_eval(x))[0]['id'])==328]

,id,belongs_to_collection,budget,genres,homepage,imdb_id,original_language,original_title,overview,popularity,...,production_countries,release_date,runtime,spoken_languages,status,tagline,title,Keywords,cast,crew
883,3884,"[{'id': 328, 'name': 'Jurassic Park Collection...",73000000,"[{'id': 12, 'name': 'Adventure'}, {'id': 28, '...",NaN,tt0119567,en,The Lost World: Jurassic Park,Four years after Jurassic Park's genetically b...,0.788123,...,"[{'iso_3166_1': 'US', 'name': 'United States o...",5/23/97,129.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,Something has survived.,The Lost World: Jurassic Park,"[{'id': 911, 'name': 'exotic island'}, {'id': ...","[{'cast_id': 1, 'character': 'Dr. Ian Malcolm'...","[{'credit_id': '52fe4238c3a36847f800d3ad', 'de..."
1934,4935,"[{'id': 328, 'name': 'Jurassic Park Collection...",150000000,"[{'id': 28, 'name': 'Action'}, {'id': 12, 'nam...",http://www.jurassicworld.com/,tt0369610,en,Jurassic World,Twenty-two years after the events of Jurassic ...,32.790475,...,"[{'iso_3166_1': 'US', 'name': 'United States o...",6/9/15,124.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,The park is open.,Jurassic World,"[{'id': 1299, 'name': 'monster'}, {'id': 1718,...",NaN,NaN
4213,7214,"[{'id': 328, 'name': 'Jurassic Park Collection...",93000000,"[{'id': 12, 'name': 'Adventure'}, {'id': 28, '...",NaN,tt0163025,en,Jurassic Park III,"In need of funds for research, Dr. Alan Grant ...",0.648867,...,"[{'iso_3166_1': 'US', 'name': 'United States o...",7/18/01,92.0,"[{'iso_639_1': 'en', 'name': 'English'}, {'iso...",Released,"This time, it's not just a walk in the park!",Jurassic Park III,"[{'id': 911, 'name': 'exotic island'}, {'id': ...","[{'cast_id': 1, 'character': 'Dr. Alan Grant',...","[{'credit_id': '52fe4238c3a36847f800d479', 'de..."

Indeed

**I will include collections with only 1 item as well**

In [15]:
# get all revenues for each collection

In [25]:
revenues = []
stdevs = []
for collection in uniq:
    # select all movies from this collections
    revenues.append(train[train['belongs_to_collection'].fillna('[{"id":-1}]').map(
        lambda x: (ast.literal_eval(x))[0]['id'])==collection]['revenue'].mean())
    stdevs.append(train[train['belongs_to_collection'].fillna('[{"id":-1}]').map(
        lambda x: (ast.literal_eval(x))[0]['id'])==collection]['revenue'].std())

check one at random to make sure it was correctly computed

In [17]:
uniq[0], uniq[77],uniq[-1]

(10, 12087, 479888)

In [18]:
train[train['belongs_to_collection'].fillna('[{"id":-1}]').map(
        lambda x: (ast.literal_eval(x))[0]['id'])==10]

,id,belongs_to_collection,budget,genres,homepage,imdb_id,original_language,original_title,overview,popularity,...,release_date,runtime,spoken_languages,status,tagline,title,Keywords,cast,crew,revenue
689,690,"[{'id': 10, 'name': 'Star Wars Collection', 'p...",113000000,"[{'id': 878, 'name': 'Science Fiction'}, {'id'...",http://www.starwars.com/films/star-wars-episod...,tt0121766,en,Star Wars: Episode III - Revenge of the Sith,"Years after the onset of the Clone Wars, the n...",13.165421,...,5/17/05,140.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,The saga is complete.,Star Wars: Episode III - Revenge of the Sith,"[{'id': 797, 'name': 'showdown'}, {'id': 10013...","[{'cast_id': 13, 'character': 'Obi-Wan Kenobi'...","[{'credit_id': '52fe431fc3a36847f803bea3', 'de...",850000000
1818,1819,"[{'id': 10, 'name': 'Star Wars Collection', 'p...",120000000,"[{'id': 12, 'name': 'Adventure'}, {'id': 28, '...",http://www.starwars.com/films/star-wars-episod...,tt0121765,en,Star Wars: Episode II - Attack of the Clones,"Ten years after the invasion of Naboo, the gal...",14.072511,...,5/15/02,142.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,A Jedi Shall Not Know Anger. Nor Hatred. Nor L...,Star Wars: Episode II - Attack of the Clones,"[{'id': 1399, 'name': 'senate'}, {'id': 5340, ...","[{'cast_id': 7, 'character': 'Obi Wan Kenobi',...","[{'credit_id': '52fe431fc3a36847f803bd8b', 'de...",649398328

In [19]:
(850000000 + 649398328)/2 / MILLION

749.699164

In [20]:
revenues[0] / MILLION

749.699164

In [21]:
train[train['belongs_to_collection'].fillna('[{"id":-1}]').map(
        lambda x: (ast.literal_eval(x))[0]['id'])==12087]

,id,belongs_to_collection,budget,genres,homepage,imdb_id,original_language,original_title,overview,popularity,...,release_date,runtime,spoken_languages,status,tagline,title,Keywords,cast,crew,revenue
1862,1863,"[{'id': 12087, 'name': 'Herbie Collection', 'p...",50000000,"[{'id': 35, 'name': 'Comedy'}, {'id': 10751, '...",NaN,tt0400497,en,Herbie Fully Loaded,"Maggie Peyton, the new owner of Number 53 - th...",9.35239,...,6/22/05,101.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,Start your engines...,Herbie Fully Loaded,"[{'id': 830, 'name': 'car race'}, {'id': 6067,...","[{'cast_id': 1, 'character': 'Maggie Peyton', ...","[{'credit_id': '59620742925141790403a4fe', 'de...",66002004

In [22]:
revenues[77]

66002004.0

In [23]:
train[train['belongs_to_collection'].fillna('[{"id":-1}]').map(
        lambda x: (ast.literal_eval(x))[0]['id'])==479888]

,id,belongs_to_collection,budget,genres,homepage,imdb_id,original_language,original_title,overview,popularity,...,release_date,runtime,spoken_languages,status,tagline,title,Keywords,cast,crew,revenue
2891,2892,"[{'id': 479888, 'name': 'The Thing Collection'...",35000000,"[{'id': 27, 'name': 'Horror'}, {'id': 878, 'na...",http://www.uphe.com/movies/the-thing-2011,tt0905372,en,The Thing,When paleontologist Kate Lloyd travels to an i...,10.169411,...,10/12/11,103.0,"[{'iso_639_1': 'en', 'name': 'English'}, {'iso...",Released,It's Not Human. Yet.,The Thing,"[{'id': 2340, 'name': 'paranoia'}, {'id': 4713...","[{'cast_id': 2, 'character': 'Kate Lloyd', 'cr...","[{'credit_id': '537b713fc3a3682d3c00000e', 'de...",28128670

In [24]:
revenues[-1]

28128670.0

In [44]:
train[train['belongs_to_collection'].fillna('[{"id":-1}]').map(
        lambda x: (ast.literal_eval(x))[0]['id'])==10]['revenue'].std()

141846802.58855957

In [68]:
sss = [s if s>-float('inf') else 0 for s in stdevs]

In [71]:
pd.DataFrame(np.matrix((revenues,sss)).T,index=uniq,columns=['average_revenue','stdev'],dtype=int).to_csv('collections.csv')

### genres

In [9]:
train['genres'].fillna('[]').map(
    lambda x: len(ast.literal_eval(x))).value_counts()

2    972
3    900
1    593
4    393
5    111
6     21
0      7
7      3
Name: genres, dtype: int64

In [70]:
# get all genre id lists
genres_lists = train['genres'].fillna('[]').map(
    lambda x: [i['id'] for i in (ast.literal_eval(x))]).values

all_genres = []
for l in genres_lists:
    # add all lists together
    all_genres.extend(l)
# keep only uniques
all_genres = set(all_genres)
# convert back to list
all_genres = list(all_genres)

In [71]:
all_genres

[10752,
 10402,
 35,
 99,
 37,
 36,
 12,
 878,
 14,
 16,
 80,
 18,
 9648,
 10769,
 53,
 10770,
 27,
 28,
 10749,
 10751]

In [72]:
# build genres table
revenue = []
for g in all_genres:
    revenue.append(train[train['genres'].fillna('[]').map(
        lambda x: g in [i['id'] for i in (ast.literal_eval(x))])]['revenue'].mean())

In [73]:
# build names table
names = []
for i in train['genres'].fillna('[]').map(lambda x: [(i['id'],i['name']) for i in (ast.literal_eval(x))]).values.tolist():
    names.extend(i)
names = set(names)
names = dict(names)
names

{878: 'Science Fiction',
 9648: 'Mystery',
 27: 'Horror',
 16: 'Animation',
 80: 'Crime',
 10752: 'War',
 10769: 'Foreign',
 10751: 'Family',
 28: 'Action',
 14: 'Fantasy',
 12: 'Adventure',
 10749: 'Romance',
 37: 'Western',
 36: 'History',
 10770: 'TV Movie',
 35: 'Comedy',
 18: 'Drama',
 99: 'Documentary',
 53: 'Thriller',
 10402: 'Music'}

In [75]:
ordered_names = [names[i] for i in all_genres]

In [85]:
pd.DataFrame({'name':ordered_names,'revenue':revenue},index=all_genres).to_csv('genres.csv')